Tekla.Structures.Analysis.AnalysisAreaPolygon
The AnalysisAreaPolygon class contains information related to analysis area polygons.

Tekla.Structures.Analysis.AnalysisAreaPolygon._Positions
The positions of the area polygon.

Tekla.Structures.Analysis.AnalysisAreaPolygon._Edges
The edges of the area polygon.

Tekla.Structures.Analysis.AnalysisAreaPolygon.#ctor(Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum)
Creates a new instance of the AnalysisAreaPolygon class.
ObjectType: The type of the analysis object.

Tekla.Structures.Analysis.AnalysisAreaPolygon.Positions
The positions of the area polygon.

Tekla.Structures.Analysis.AnalysisAreaPolygon.Edges
The edges of the area polygon.

Tekla.Structures.Analysis.AnalysisAreaPolygon.Insert
Inserts an analysis area polygon.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisAreaPolygon.Select
Selects an analysis area polygon.
The AnalysisObjectType has to be set.

Tekla.Structures.Analysis.AnalysisAreaPolygon.GetPositions
Gets the positions of the area polygon.
Returns: The positions of the area polygon.

Tekla.Structures.Analysis.AnalysisAreaPolygon.GetEdges
Gets the edges of the area polygon.
Returns: The edges of the area polygon.

Tekla.Structures.Analysis.AnalysisAreaPolygon.Add(Tekla.Structures.Analysis.AnalysisPosition)
Adds a position to the analysis area polygon.
Also adds an edge.
AnalysisPosition: The position to be added.

Tekla.Structures.Analysis.AnalysisAreaPolygon.InsertInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisAreaPolygon.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisAreaPolygon.CreatePositionEnumerator
Create position enumerator.

Tekla.Structures.Analysis.AnalysisAreaPolygon.CreateEdgeEnumerator
Create edge enumerator.

Tekla.Structures.Analysis.AnalysisAreaPolygon.CollectData
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisAreaPolygon.AddAnalysisPosition(Tekla.Structures.Analysis.AnalysisPosition)
Adds position to analysis area polygon. Adds (default) edge also.